In [1]:
import pandas as pd

series : single dimensional
dataframe : for tabular form

In [4]:
data = [1,2,3,4,5,6,7,8,9]
s1 = pd.Series(data)
s1

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [5]:
type(s1)

pandas.core.series.Series

In [7]:
s1.values

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [8]:
s1.index

RangeIndex(start=0, stop=9, step=1)

In [10]:
data = [1,2,3,4,5]
s2 = pd.Series(data)
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
s2.index = ['a','b','c','d','e']
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
s2[3]

4

In [13]:
s2['d']

4

iloc refer by positional value like 0 1 2 3
loc refer by index a b c

In [14]:
s2.iloc[2]

3

In [15]:
s2.loc['c']

3

In [17]:
s2['c']=5
s2

a    1
b    2
c    5
d    4
e    5
dtype: int64

In [19]:
s2.loc['g']=7
s2

a    1
b    2
c    5
d    4
e    5
g    7
dtype: int64

In [20]:
1 in s2.values

True

In [22]:
'g' in s2.index

True

In [23]:
s2[1:4]

b    2
c    5
d    4
dtype: int64

In [24]:
data = {'Jaipur':'Rajasthan' ,
        'Mumbai':'Maharashtra' ,
        'Kolkata':'West Bengal' ,
        'Bengaluru':'Karnataka' , 
        'Chandigarh':'Punjab'}

s2=pd.Series(data)
s2

Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Bengaluru       Karnataka
Chandigarh         Punjab
dtype: object

In [25]:
s2.name = 'Capitals and States'
s2.index.name = 'Capitals'
s2

Capitals
Jaipur          Rajasthan
Mumbai        Maharashtra
Kolkata       West Bengal
Bengaluru       Karnataka
Chandigarh         Punjab
Name: Capitals and States, dtype: object

In [28]:
s2['Jaipur']

'Rajasthan'

In [29]:
s2[['Jaipur']]

Capitals
Jaipur    Rajasthan
Name: Capitals and States, dtype: object

In [27]:
s2[['Jaipur','Kolkata','Mumbai']]

Capitals
Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Name: Capitals and States, dtype: object

In [33]:
capitals = ['Jaipur','Kolkata','Mumbai','Delhi']
s3 = pd.Series(s2,index=capitals)
s3

Jaipur       Rajasthan
Kolkata    West Bengal
Mumbai     Maharashtra
Delhi              NaN
Name: Capitals and States, dtype: object

In [34]:
s3.isnull()

Jaipur     False
Kolkata    False
Mumbai     False
Delhi       True
Name: Capitals and States, dtype: bool

In [35]:
s3.notnull()

Jaipur      True
Kolkata     True
Mumbai      True
Delhi      False
Name: Capitals and States, dtype: bool

In [36]:
s3.duplicated()

Jaipur     False
Kolkata    False
Mumbai     False
Delhi      False
Name: Capitals and States, dtype: bool

In [38]:
s3.duplicated().sum()

0

In [39]:
s2 = pd.Series(['India','Australia','England'] , index=['Cricket','Cricket','Cricket'])
s2

Cricket        India
Cricket    Australia
Cricket      England
dtype: object

In [40]:
s2['Cricket']

Cricket        India
Cricket    Australia
Cricket      England
dtype: object

# Dataframe

In [41]:
student1 = pd.Series({'Name':'Yash' , 'Id':1})
student2 = pd.Series({'Name':'Raj' , 'Id':2})
student3 = pd.Series({'Name':'om' , 'Id':3})

In [42]:
df1 = pd.DataFrame([student1,student2,student3] , index=[101,102,103])
df1

     Name  Id
101  Yash   1
102   Raj   2
103    om   3

In [43]:
data = {'Name' : ['Yash','Raj', 'Om'], 'Id' : [1,2,3]}
df2 = pd.DataFrame(data, index=[101,102,103])
df2

     Name  Id
101  Yash   1
102   Raj   2
103    Om   3

In [45]:
df3 = pd.DataFrame(data=data , index=[101,102,103] , columns=['Name','Id','Age'])
df3

     Name  Id  Age
101  Yash   1  NaN
102   Raj   2  NaN
103    Om   3  NaN

In [46]:
df3.index

Int64Index([101, 102, 103], dtype='int64')

In [47]:
df3.values

array([['Yash', 1, nan],
       ['Raj', 2, nan],
       ['Om', 3, nan]], dtype=object)

In [48]:
df3.columns

Index(['Name', 'Id', 'Age'], dtype='object')

In [49]:
df3.Age = 25
df3

     Name  Id  Age
101  Yash   1   25
102   Raj   2   25
103    Om   3   25

In [53]:
df3.Age = [23,54,13]
df3

     Name  Id  Age
101  Yash   1   23
102   Raj   2   54
103    Om   3   13

In [51]:
df3.Name

101    Yash
102     Raj
103      Om
Name: Name, dtype: object

In [54]:
df3.iloc[0]

Name    Yash
Id         1
Age       23
Name: 101, dtype: object

In [55]:
df3.loc[101]

Name    Yash
Id         1
Age       23
Name: 101, dtype: object

In [57]:
df3.loc[104] = ['Suraj' , 4 , 26]
df3

      Name  Id  Age
101   Yash   1   23
102    Raj   2   54
103     Om   3   13
104  Suraj   4   26

In [58]:
df3['Age']

101    23
102    54
103    13
104    26
Name: Age, dtype: int64

In [60]:
df3[['Age','Name']]

     Age   Name
101   23   Yash
102   54    Raj
103   13     Om
104   26  Suraj

In [61]:
df3[1:3]

    Name  Id  Age
102  Raj   2   54
103   Om   3   13

In [62]:
df3.loc[101]['Name']

'Yash'

In [64]:
df3.loc[101][['Name','Age']]

Name    Yash
Age       23
Name: 101, dtype: object

In [67]:
df3.loc[[101,102]][['Name','Age']]

     Name  Age
101  Yash   23
102   Raj   54

In [68]:
df3.iloc[0]

Name    Yash
Id         1
Age       23
Name: 101, dtype: object

In [69]:
df3.iloc[2]['Name']

'Om'

In [70]:
df3.iloc[2][['Name','Age']]

Name    Om
Age     13
Name: 103, dtype: object

In [71]:
df3.iloc[[0,1]]['Name']

101    Yash
102     Raj
Name: Name, dtype: object

In [72]:
type(df3.iloc[0])

pandas.core.series.Series

In [79]:
type(df3.loc[:,'Name'])

pandas.core.series.Series

In [80]:
df3.loc[:,['Name','Age']]

      Name  Age
101   Yash   23
102    Raj   54
103     Om   13
104  Suraj   26

In [104]:
df3[df3.Age > 25]

      Name  Id  Age
102    Raj   2   54
104  Suraj   4   26

In [106]:
df3[df3.Age > 25]['Name']

102      Raj
104    Suraj
Name: Name, dtype: object

In [107]:
df3.query('Age > 25')

      Name  Id  Age
102    Raj   2   54
104  Suraj   4   26

In [81]:
df3.head()

      Name  Id  Age
101   Yash   1   23
102    Raj   2   54
103     Om   3   13
104  Suraj   4   26

In [82]:
df3.tail(2)

      Name  Id  Age
103     Om   3   13
104  Suraj   4   26

In [83]:
df3.isnull().sum()

Name    0
Id      0
Age     0
dtype: int64

In [84]:
df3.duplicated().sum()

0

In [86]:
df3.sort_index(ascending = False)

      Name  Id  Age
104  Suraj   4   26
103     Om   3   13
102    Raj   2   54
101   Yash   1   23

In [87]:
df3.sort_values(by='Age')

      Name  Id  Age
103     Om   3   13
101   Yash   1   23
104  Suraj   4   26
102    Raj   2   54

In [88]:
df3['Name'].nunique()

4

In [100]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 101 to 104
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Id      4 non-null      int64
 2   Age     4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [89]:
import numpy as np
data = {'A' : np.arange(11,21),
        'B' : np.arange(21,31),
        'C' : np.arange(31,41)}
df = pd.DataFrame(data)
df

    A   B   C
0  11  21  31
1  12  22  32
2  13  23  33
3  14  24  34
4  15  25  35
5  16  26  36
6  17  27  37
7  18  28  38
8  19  29  39
9  20  30  40

In [90]:
df.sum(axis=1)

0    63
1    66
2    69
3    72
4    75
5    78
6    81
7    84
8    87
9    90
dtype: int64

In [91]:
df.sum()

A    155
B    255
C    355
dtype: int64

In [92]:
df.mean()

A    15.5
B    25.5
C    35.5
dtype: float64

In [94]:
df.min()

A    11
B    21
C    31
dtype: int32

In [95]:
df.max()

A    20
B    30
C    40
dtype: int32

In [96]:
df.var()

A    9.166667
B    9.166667
C    9.166667
dtype: float64

In [97]:
df.std()

A    3.02765
B    3.02765
C    3.02765
dtype: float64

In [98]:
df.median()

A    15.5
B    25.5
C    35.5
dtype: float64

In [99]:
df.describe()

              A         B         C
count  10.00000  10.00000  10.00000
mean   15.50000  25.50000  35.50000
std     3.02765   3.02765   3.02765
min    11.00000  21.00000  31.00000
25%    13.25000  23.25000  33.25000
50%    15.50000  25.50000  35.50000
75%    17.75000  27.75000  37.75000
max    20.00000  30.00000  40.00000

In [101]:
df.corr()

     A    B    C
A  1.0  1.0  1.0
B  1.0  1.0  1.0
C  1.0  1.0  1.0

In [108]:
pd.concat([df3,df3])

      Name  Id  Age
101   Yash   1   23
102    Raj   2   54
103     Om   3   13
104  Suraj   4   26
101   Yash   1   23
102    Raj   2   54
103     Om   3   13
104  Suraj   4   26

In [109]:
pd.concat([df3,df3] , axis=1)

      Name  Id  Age   Name  Id  Age
101   Yash   1   23   Yash   1   23
102    Raj   2   54    Raj   2   54
103     Om   3   13     Om   3   13
104  Suraj   4   26  Suraj   4   26